Repository: perdiy/Template-Project
Catalog: lib/core/localization/intl_*.arb
Languages: id

source: Home
id: Beranda

source: Profile
id: Profil

source: Activity
id: Aktivitas

source: Your Activity
id: Aktivitas Anda

source: Dashboard
id: Beranda

source: About
id: Tentang

# selectDate
source: Choose Date
id: Pilih Tanggal

# selectTime
source: Choose Time
id: Pilih Waktu

source: Select
id: Pilih

source: Cancel
id: Batal

source: Please Wait...
id: Harap tunggu...

source: Login
id: Masuk

# email
source: Email Address
id: Email

source: NIP or Username
id: NIP atau Username

source: Password
id: Kata Sandi

source: Register
id: Daftar disini

# askRegister
source: Don't have an Account?
id: Belum punya akun?

# errorInvalidEmail
source: Email is not valid
id: Email tidak valid

# errorEmptyField
source: Can't be empty
id: Tidak boleh kosong

# errorPasswordLength
source: Password must be at least 6 characters
id: Kata Sandi minimal 6 karakter

# errorNipOrUsename
source: Enter a valid NIP or Username
id: Masukkan NIP atau Username yang valid

# passwordRepeat
source: Repeat Password
id: Ulangi Kata Sandi

# errorPasswordNotMatch
source: Password doesn't match
id: Kata Sandi tidak sama

source: Settings
id: Pengaturan

source: Theme Light
id: Tema Terang

source: Theme Dark
id: Tema Gelap

source: Theme System
id: Tema Sistem

source: Choose Theme
id: Pilih tema

source: Choose Language
id: Pilih bahasa

# errorNoData
source: No data
id: Data Kosong

source: Logout
id: Keluar

# logoutDesc
source: Do you want to logout from the app?
id: Apakah anda ingin keluar dari aplikasi?

source: Yes
id: Ya

# descLogin
source: Enter your NIP or Username to log in
id: Masukkan email Anda di bawah ini untuk masuk ke akun Anda

# forgotPassword
source: Forgot your password?
id: Lupa kata sandi?

# appVersion
source: Version
id: Versi

# descResetPassword
source: Enter the email associated with your account and we'll send an email with instructions to reset your password.
id: Masukkan email yang terkait dengan akun Anda dan kami akan mengirimkan email dengan instruksi untuk mengatur ulang kata sandi Anda.

source: Send Instruction
id: Kirim Instruksi

source: Create New Password
id: Buat Kata Sandi Baru

# descNewPassword
source: Your new password must be different from previous used passwords.
id: Kata sandi baru Anda harus berbeda dari kata sandi yang digunakan sebelumnya.

source: Current Password
id: Kata Sandi Saat Ini

source: New Password
id: Kata Sandi Baru

source: Confirm Password
id: Konfirmasi Kata Sandi

source: Reset Password
id: Atur Ulang Kata Sandi

# dialogLocationPermission
source: Enable Location for Seamless Attendance
id: Aktifkan Lokasi untuk Kehadiran yang Lancar

source: Turn On Location
id: Aktifkan Lokasi

# dialogOutsideArea
source: You’re outside the attendance area
id: Anda berada di luar area kehadiran

# dialogDescOutsideArea
source: Sorry, it looks like you are outside the absence area. To continue, please do so with permissions.
id: Maaf, sepertinya Anda berada di luar area ketidakhadiran. Untuk melanjutkan, harap lakukan dengan izin.

# permission
source: Permissions
id: Izin

# titleAttendanceSuccess
source: Attendance Successfully!
id: Kehadiran Berhasil!

# descAttendanceInSuccess
source: Welcome! Your clock-in has been successfully recorded. Have a productive day ahead!
id: Selamat datang! Waktu masuk Anda telah direkam dengan sukses. Semoga hari Anda produktif!

# descAttendanceOutSuccess
source: Great work today! Your clock-out has been successfully recorded. Rest well and see you tomorrow!
id: Kerja bagus hari ini! Waktu keluar Anda has been successfully recorded. Istirahatlah dengan baik dan sampai jumpa besok!

source: Done
id: Selesai

# dialogTitleUpdate
source: The latest version of this attendance application, version 2.0, is now available for you to download and install.
id: Versi terbaru dari aplikasi kehadiran ini, versi 2.0, sekarang tersedia untuk download dan instal.

# dialogDescUpdate
source: Please click the Update button below to access the application file and download the latest version.
id: Silakan klik tombol Perbarui di bawah ini untuk mengakses file aplikasi dan mengunduh versi terbaru.

source: Update
id: Perbarui

source: Face Not Recognized
id: Wajah Tidak Dikenali

# descFaceNotRecognized
source: We’re sorry, but your face was not recognized in our system. Please ensure you are registered or contact support for assistance
id: Kami mohon maaf, tetapi wajah Anda tidak dikenali dalam sistem kami. Harap pastikan Anda terdaftar atau hubungi dukungan untuk bantuan

source: Face Not Detected
id: Wajah Tidak Terdeteksi

# descFaceNotDetected
source: Your face was not detected. Please ensure your face is within the camera frame during the process.
id: Wajah Anda tidak terdeteksi. Pastikan wajah berada di dalam frame kamera saat proses berlangsung.

# titleAttendanceUnsuccessful
source: Attendance Unsuccessful!
id: Kehadiran Tidak Berhasil!

# descAttendanceUnsuccessful
source: We encountered an issue with your attendance. Please try again or contact support if the problem persists. Thank you for your understanding!
id: Kami mengalami masalah dengan absen Anda. Harap coba lagi atau hubungi dukungan jika masalah berlanjut. Terima kasih atas pengertian Anda!

source: Try Again
id: Coba Lagi

source: Successfully
id: Berhasil

# descSuccessResetPassword
source: Your password has been changed
id: Kata sandi berhasil diubah

source: Go to Home
id: Kembali ke Beranda

source: Leave Letter
id: Surat Izin

source: My Payslip
id: Gaji Saya

source: Task List
id: Daftar Tugas

source: Assessment
id: Penilaian

source: Reimbursement
id: Pergantian Biaya

source: Permission Letter
id: Surat Izin

source: Overtime Letter
id: Surat Lembur

source: Report
id: Laporan

source: Days
id: Hari

source: Clock In
id: Jam Masuk

source: Clock Out
id: Jam Keluar

# workingHour
source: Working Hours
id: Jam Kerja

source: Hours
id: Jam

source: Attendance
id: Kehadiran

source: Current Month
id: Bulan Ini

source: Attend
id: Hadir

source: Absent
id: Izin

source: Late In
id: Terlambat Masuk

source: Total Leaves
id: Total Izin

source: Account
id: Akun

source: Awards
id: Penghargaan

source: Change Password
id: Ubah Kata Sandi

source: Reset Face
id: Reset Wajah

source: Others
id: Lainnya

source: Language
id: Bahasa

# termAndCondition
source: Term and Conditions
id: Syarat dan Ketentuan

source: Help
id: Bantuan

source: Contact Us
id: Hubungi Kami

source: Management Profile
id: Profil Manajemen

source: Change Profile Picture
id: Ubah Foto Profil

source: First Name
id: Nama Depan

source: Last Name
id: Nama Belakang

# nik
source: National ID Number
id: NIK

source: Place of Birth
id: Tempat Lahir

source: Gender
id: Jenis Kelamin

source: Religion
id: Agama

source: Marital Status
id: Status Pernikahan

source: Blood Type
id: Golongan Darah

source: Citizen ID Address
id: Alamat KTP

source: Set as Residential Address
id: Atur Sebagai Alamat Tinggal

source: Residential Address
id: Alamat Tinggal

source: Save
id: Simpan

source: Confirm
id: Konfirmasi

source: Current Location
id: Lokasi Saat Ini

source: Setup Face Verification
id: Atur Verifikasi Wajah

# descSetupFaceVerification
source: Unlock Attendance with Your Face Fast and Secure
id: Daftarkan wajah anda untuk proses absensi Cepat dan Aman

source: Start Setup Face Verification
id: Mulai Atur Verifikasi Wajah

source: Face Not Found
id: Wajah Tidak Dikenali

# faceFound
source: Please keep your face centered in the screen and facing forward
id: Silakan pertahankan wajah Anda di tengah layar dan menghadap ke depan

# faceRegisterSuccessDesc
source: Your smile just unlocked a world of possibilities. Welcome! You're officially verified, and that's awesome!
id: Senyum Anda telah membuka peluang berbagai kemungkinan. Selamat! Anda telah terverifikasi dan itu sangat bagus!

source: Error Processing Face
id: Error Proses Wajah

source: Please Blink
id: Silakan Kedipkan Mata

source: Please Smile
id: Silakan Senyum

source: Look Up
id: Melihat Ke Atas

source: Look Down
id: Melihat Ke Bawah

# lookLeft
source: Look to the Left
id: Melihat Ke Kiri

# lookRight
source: Look to the Right
id: Melihat Ke Kanan

source: Select Month
id: Pilih Bulan

# descPeriodPayslip
source: Please choose the pay period from the options above.
id: Silakan pilih periode gaji dari opsi di atas.

source: Income
id: Pendapatan

source: Basic Salary
id: Gaji Pokok

source: Other Allowance
id: Tunjangan Lainnya

source: Position Allowance
id: Tunjangan Jabatan

source: Overtime Allowance
id: Tunjangan Lembur

source: Attendance Allowance
id: Tunjangan Kehadiran

source: Total Income
id: Total Pendapatan

source: Deductions
id: Potongan

source: JHT Employee
id: JHT Karyawan

source: JPK Employee
id: JPK Karyawan

source: Loan
id: Pinjaman

source: Attendance Deduction
id: Potongan Kehadiran

source: Adjustment Value
id: Nilai Penyesuaian

source: Total Deduction
id: Total Potongan

source: Attendance Summary
id: Ringkasan Kehadiran

source: Actual Working Days
id: Hari Kerja Aktual

source: Workday Schedule
id: Jadwal Kerja

source: Day Off
id: Hari Libur

source: Public Holiday
id: Hari Libur Nasional

source: Holiday Change
id: Perubahan Libur

source: Special Holiday
id: Hari Libur Khusus

source: Overtime
id: Lembur

source: Overdays
id: Hari Lebih

source: Sick Leave
id: Cuti Sakit

source: Leave Permit
id: Izin Cuti

source: Outstation
id: Dinas Luar

source: Download Payslip
id: Unduh Slip Gaji

# payslipAutoGenerated
source: *This payslip is automatically generated by system and does not require a wet signature
id: *Slip gaji ini dihasilkan secara otomatis oleh sistem dan tidak memerlukan tanda tangan basah

# payslipConfidential
source: THE INFORMATION PROVIDED IN THIS QUESTIONNAIRE IS CONFIDENTIAL AND WILL ONLY BE DISCLOSED IF REQUIRED FOR TAX, LEGAL, OR GOVERNMENTAL PURPOSES. ANY BREACH OF THIS CONFIDENTIALITY WILL RESULT IN SANCTIONS, INCLUDING DISCIPLINARY ACTION
id: INFORMASI YANG DIBERIKAN DALAM ANGKET INI ADALAH RAHASIA DAN HANYA AKAN DIUNGKAPKAN JIKA DIPERLUKAN UNTUK PAJAK, HUKUM, ATAU TUJUAN PEMERINTAHAN. SETIAP PELANGGARAN TERHADAP KERAHASIAAN INI AKAN MENGAKIBATKAN SANKSI, TERMASUK TINDAKAN DISIPLIN.

source: Take Home Pay
id: Gaji Bersih

source: Male
id: Laki-laki

source: Female
id: Perempuan

source: Single
id: Belum Menikah

source: Mariage
id: Menikah

source: Widow
id: Janda/Duda

source: Date of Birth
id: Tanggal Lahir

source: Set the dates
id: Atur Tanggal

# descResetLink
source: We've sent a password reset link to your email
id: Kami telah mengirim tautan reset kata sandi ke email Anda

source: Camera
id: Kamera

source: Gallery
id: Galeri

# errorPickImage
source: Error picking image
id: Terjadi kesalahan saat memilih gambar

# profilePickUpdate
source: Profile picture updated
id: Foto profil diubah

source: Capture Face
id: Ambil Wajah

source: Session Expired
id: Sesi Kadaluarsa

# sessionExpiredDesc
source: Your session has ended due to inactivity. Please log in again to continue.
id: Sesi Anda telah berakhir karena tidak aktif. Silakan masuk kembali untuk melanjutkan.

# editDataSuccess
source: Data updated
id: Data diubah

# changePasswordSuccess
source: Password updated
id: Kata sandi diubah

source: Type
id: Jenis

source: Period
id: Periode

source: Monthly Report
id: Laporan Bulanan

source: Annual Report
id: Laporan Tahunan

source: Newest - Oldest
id: Terbaru - Terlama

source: Oldest - Newest
id: Terlama - Terbaru

source: Sort By
id: Urutkan Berdasarkan

source: All Leave
id: Semua Izin

source: Leave Balance
id: Saldo Izin

source: Leave Approved
id: Izin Disetujui

source: Leave Pending
id: Izin Menunggu

source: Leave Cancelled
id: Izin Dibatalkan

source: Apply Leave
id: Ajukan Izin

source: My Application
id: Pengajuan Saya

source: Apply Days
id: Hari Izin

source: Approved By
id: Disetujui Oleh

source: Leave Application Form
id: Formulir Pengajuan Izin

# leaveApplicationFormDesc
source: Please provide information about your leave
id: Silakan isi informasi tentang izin Anda

source: Medical
id: Medis

source: Emergency
id: Darurat

source: Other
id: Lainnya

source: Full Day
id: Satu Hari

source: Half Day
id: Setengah Hari

source: Leave Type
id: Jenis Izin

source: Period Leave
id: Periode Izin

source: Select Leave Date
id: Pilih Tanggal Izin

source: Reason Leave
id: Alasan Izin

source: Apply Reimbursement
id: Ajukan Pergantian Biaya

source: Claim Amount
id: Jumlah Pengajuan

source: Pending
id: Menunggu

source: Rejected
id: Ditolak

source: Approved
id: Disetujui

source: Reimbursement Type
id: Jenis Pergantian Biaya

source: Bill Number
id: Nomor Bill

source: Bill Amount
id: Jumlah Bill

source: Remarks
id: Catatan

# billAttach
source: Bill Attachment
id: Lampiran Bill

source: Travel
id: Perjalanan

source: Operational
id: Operasional

# dialogFakeGps
source: Fake GPS Detected
id: Terdeteksi Lokasi Palsu

# dialogFakeGpsDesc
source: You are using fake GPS, please turn off the service to use this application
id: Anda terdeteksi menggunakan lokasi palsu, Silahkan matikan layanan tersebut untuk menggunakan aplikasi

# dialogNewDevice
source: New Device Detected
id: Terdeteksi Perangkat Baru

# dialogNewDeviceDesc
source: You are using a new device, please register your face to use this application
id: Anda terdeteksi menggunakan perangkat baru, Silahkan register wajah anda untuk menggunakan aplikasi

# underDevelopmentTitle
source: Under Development
id: Dalam Pengembangan

# underDevelopmentDesc
source: We're working on this feature, Stay tuned for future updates.
id: Kami sedang mengerjakan fitur ini, Nantikan update selanjutnya.
